import torch

# 张量的拼接
def demo():
    # [[3, 1, 9],
    #  [9, 9, 6]]
    #
    # [[5, 9, 6],
    #  [5, 1, 6]]
    t1 = torch.randint(1, 10, (2,3))
    t2 = torch.randint(1, 10, (2,3))
    print(t1)
    print(t2)

    t3 = torch.cat([t1, t2], dim=0) # (2, 3) + (2, 3) = (4, 3)
    print(t3)

    t4 = torch.cat([t1, t2], dim=1) # (2, 3) + (2, 3) = (2, 6)
    print(t4)

    t5 = torch.cat([t1, t2], dim=-1) # (2, 3) + (2, 3) = (2, 6)
    print(t5)

    # t6 = torch.cat([t1, t2], dim=2) #报错
    # print(t6)

    # stack() 拼接张量，可以是新维度，但是所有输入的张量形状必须完全相同
    # torch.stack() 新维度的位置由dim参数决定
    # 新维度的大小恒等被拼接的张量个数，这里是由t1，t2两个张量，所以是2
    # 源数据
    # t1: [ 0维
    #       [3, 1, 9], 1维
    #       [9, 9, 6]  1维
    #     ]
    #
    # t2: [ 0维
    #       [5, 9, 6], 1维
    #       [5, 1, 6]  1维
    #     ]
    t7 = torch.stack([t1, t2], dim=0)  #(2, 3) + (2, 3) = (2, 2, 3) 在0维上相加，两个2行3列的数据
    # t1:
    #   [
    #     [ 0维
    #       [3, 1, 9], 1维
    #       [9, 9, 6]  1维
    #     ]
    #
    # t2:
    #     [ 0维
    #       [5, 9, 6], 1维
    #       [5, 1, 6]  1维
    #     ]
    #   ]
    print(t7)

    # (2, 3) + (2, 3) = (2, 2, 3)
    # 在1维上相加，2个2行3列的数据，t1的第一个一维和t2的第一个一维数据拼接。t1的第二个一维和t2的第二个一维拼接
    t8 = torch.stack([t1, t2], dim=1)
    # [
    #   [
    #     [3, 1, 9],
    #     [5, 9, 6]
    #   ],
    #
    #   [
    #     [9, 9, 6],
    #     [5, 1, 6]
    #   ]
    # ]
    print(t8)


    t9 = torch.stack([t1, t2], dim=2)  #(2, 3) + (2, 3) = (2, 3, 2)
    # [[[3, 5],
    #   [1, 9],
    #   [9, 6]],
    #
    #  [[9, 5],
    #   [9, 1],
    #   [6, 6]]]
    print(t9)



if __name__ == '__main__':
    demo()